Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/separation_and_divorce/dissolution_decrees.html.txt.tmx
Source language: en
Languages: ga

source: A decree of dissolution allows both parties to a civil partnership to marry
ga: Ceadaíonn foraithne díscaoileadh don dá pháirtí i bpáirtnéireacht shibhialta pósadh

source: If a court is satisfied that the required conditions (see Rules below) are met, the court will grant the decree of dissolution, dissolving the civil partnership
ga: Má tá cúirt sásta go bhfuil na conníollacha riachtanacha comhlíonta (féach Rialacha thíos), bronnfaidh an chúirt foraithne díscaoileadh, a dhíscaoileoidh an pháirtnéireacht shibhialta

source: When it grants the decree of dissolution, the court may also make orders in relation to the payment of maintenance and lump sums, the transfer of property, the extinguishment of succession rights, pension rights etc
ga: Nuair a bhronnfaidh sí an foraithne díscaoileadh, d’fhéadfaí freisin go ndéanfaidh an chúirt orduithe i ndáil le híocaíocht chothábhála agus cnapshuimeanna, aistriú réadmhaoine, cearta comharbais, pinsin a mhúchadh agus rl

source: The fact that the parties must have been living separate lives for a couple of years before an application for a dissolution is made, means that separating civil partners may enter into a separation agreement to regulate matters between them before they seek a dissolution
ga: Ciallaíonn an fhíric go raibh na páirtithe ag maireachtáil go deighilte ar feadh cúpla bliain sula ndearnadh iarratas ar dhíscaoileadh, go bhféadfaidh páirtnéirí sibhialta atá ag scaradh dul isteach i gcomhaontú idirscartha chun cúrsaí a rialú eatarthu sula lorgóidh siad díscaoileadh

source: In any application for a decree of dissolution, the court can review any previous arrangements made by the parties such as a separation agreement, particularly if the circumstances of either party has changed
ga: In aon iarratas d’fhoraithne díscaoileadh, is féidir leis an gcúirt athbhreithniú a dhéanamh ar aon socruithe déanta roimhe seo ag na páirtithe, ar nós comhaontú idirscartha, go háirithe má tá athrú tagtha ar dhálaí aon cheann de na páirtithe

source: When a decree of dissolution is granted, it cannot be reversed
ga: Nuair a bhronntar foraithne díscaoileadh, ní féidir aisiompú air

source: Either party can apply to court to have any orders made under the decree - such as maintenance - reviewed by the court
ga: Is féidir le ceachtar páirtí iarratas a chur isteach chuig an gcúirt chun go ndéanfadh an chúirt athbhreithniú ar aon ordú – ar nós cothabháil – déanta faoin bhforaithne

source: Before a court can grant a dissolution, the following conditions must be met:
ga: Sula mbronnfaidh cúirt díscaoileadh, caithfidh na coinníollacha a leanas a bheith comhlíonta:

source: • The parties must have been living apart from one another for a period amounting to 2 out of the previous 3 years before the application is made
ga: • Caithfidh go raibh na páirtithe ina gcónaí scartha óna chéile do thréimhse ar dhá bhliain é as an trí bliana sula ndearnadh an t-iarratas

source: • Proper arrangements must have been made or will be made for the civil partners and any dependent child of the civil partners
ga: • Caithfidh go ndearnadh socruithe cearta nó go ndéanfar socruithe cearta do na páirtithe sibhialta agus aon leanbh cleithiúnach den páirtithe sibhialta

source: If these conditions are met, either party to a civil partnership may apply to court for a decree of dissolution
ga: Má chomhlíontar na conníollacha seo, is féidir le ceachtar páirtí i bpáirtnéireacht shibhialta cur isteach ar iarratas d’fhoraithne díscaoileadh

source: When applying for a dissolution you will be required to submit 3 documents to the Circuit Court:
ga: Agus tú ag cur isteach ar dhíscaoileadh, beidh ort dhá cháipéis a chur isteach chuig an gCúirt Dúiche:

source: • An application form (known as a family law civil bill)
ga: • Foirm iarratais (ar a dtugtar bille sibhialta dlí teaghlaigh)

source: This document describes both you and your civil partner, your occupations and where you live
ga: Cuireann an cháipéis seo síos ort féin agus ar do pháirtí, bhur ngairmeacha beatha agus áit a bhfuil cónaí oraibh

source: It also sets out when you registered your civil partnership, for how long you have been living apart and the names and birth dates of your children
ga: Leagann sé amach freisin an uair ar chláraigh sibh bhur bpáirtnéireacht shibhialta, an fhad is atá sibh in bhur gcónaí deighilte óna chéile agus ainmneacha agus dátaí breithe bhur leanaí

source: • A sworn statement of means (Form 51)
ga: • Ráiteas mionnaithe acmhainne (Foirm 51)

source: This document sets out your assets, your income, your debts, your liabilities and your outgoings
ga: Leagann an cháipéis seo amach bhur gcuid sochair, bhur n-ioncaim, bhur bhfiacha, bhur ndochair agus bhur n-eisíocaíochtaí

source: • A sworn statement relating to the welfare of any dependent children (Form 37B)
ga: • Ráiteas faoi mhionn a bhaineann le leas do leanaí cleithiúnacha (Foirm 37B)

source: This document sets out the personal details of the children
ga: Leagtar amach sa cháipéis seo sonraí pearsanta faoi leanaí

source: It describes where they live and with whom
ga: Déanann sí cur síos ar an áit a gcónaíonn siad agus na daoine a gcónaíonn siad leo

source: It also describes their education and training, their health, childcare arrangements and maintenance and access arrangements
ga: Déanann sí cur síos ar a n-oideachas agus oiliúint, a sláinte, socruithe cúram leanaí agus socruithe cothabhála agus rochtana

source: There is no requirement to submit a document certifying that you have been advised of the alternatives to dissolution, as is required in divorce applications
ga: Ní bheidh aon riachtanas cáipéis a chur isteach a dheimhníonn go bhfuil comhairle faighte ar chomhroghanna ar dhíscaoileadh, mar a theastaíonn in iarratais cholscartha

source: When all of the necessary documents have been filed, you will be given a date for the court hearing
ga: Nuair atá na cáipéisí riachtanacha ar fad comhadaithe, tabharfar dáta duit don éisteacht chúirte

source: The hearing will be held in private and you will need to show the court that you meet the requirements of the Civil Partnership and Certain Rights and Obligations of Cohabitants Act 2010
ga: Reáchtálfar an éisteacht go príomhaideach agus beidh ort a thaispeáint don chúirt go gcomhlíonann tú riachtanais an Acht um Pháirtnéireacht Shibhialta agus Cearta agus Oibleagáidí ar Leith do Chomhchónaitheoirí 2010

source: If the court is satisfied that you have grounds for a dissolution, it will grant a decree of dissolution
ga: Má tá an chúirt sásta go bhfuil údar díscaoilte agat, bronnfaidh sí foraithne díscaoileadh

source: You are not legally required to use a solicitor or a barrister
ga: Níl aon cheanglas dlíthiúil ort úsáid a bhaint as aturnae nó abhcóide

source: In fact, if you wish, you can choose to represent yourself
ga: Go deimhin, más mian leat, is féidir leat rogha a dhéanamh tú féin a ionadú

source: However, there may be complex issues which may make it very difficult to apply for a dissolution without any professional help
ga: D’fhéadfaí go bhfuil saincheisteanna casta a chruthóidh an-deacrachtaí cur isteach ar dhíscaoileadh gan aon chúnamh proifisiúnta, áfach

source: Legal advice and representation is always advisable
ga: Tá comhairle agus ionadú dlíthiúil inmholta i gcónaí

source: If you and your civil partner disagree about any issue at all it is strongly advised that you go to see a family law solicitor
ga: Má bhíonn aon easaontas idir tú féin agus do pháirtnéir sibhialta faoi shaincheist ar bith, moltar go láidir aturnae dlí teaghlaigh a fheiceáil

source: You and your civil partner should not use the same solicitor
ga: Níor cheart go n-úsáidfeadh tú féin ná do pháirtnéir sibhialta an t-aturnae céanna

source: To enquire whether you are eligible for Legal Aid, you can contact your nearest law centre
ga: Chun fiosrú an bhfuil tú i dteideal Cúnamh Dlí, is féidir leat teagmháil a dhéanamh leis an ionad dlí is gaire duit

source: Legal Aid is not free and everyone must pay a contribution towards costs
ga: Níl Cúnamh Dlí saor in aisce agus caithfidh tú íocaíocht a dhéanamh chuig costais

source: FLAC (Free Legal Advice Centres) is an independent, voluntary organisation that operates a network of legal advice clinics throughout the country
ga: Is eagraíocht neamhspleách dheonach í ICDSA (Ionaid Chomhairle Dlí Saor in Aisce) a oibríonn líonra clinicí comhairle dlí ar fud na tíre

source: These clinics are confidential, free of charge and open to all
ga: Tá na clinicí seo faoi rún, saor in aisce agus oscailte do gach duine

source: Contact your nearest Citizens Information Centre for information on FLAC services in your area
ga: Téigh i dteagmháil leis an Ionad Eolais do Shaoránaigh is gaire duit d’eolas ar sheirbhísí ICDSA i do cheantar

source: FLAC also runs an information and referral line during office hours for basic legal information
ga: Ritheann ICDSA líne eolais agus atreoraithe i rith uaireanta oifige d’eolas dlí bunúsach

source: If you choose to hire a private solicitor, you should be aware that there is no fixed rate of charges for legal fees
ga: Má roghnaíonn tú aturnae príomhaideach a fhostú, ba cheart go mbeadh a fhios agat nach bhfuil aon ráta seasta do mhuirir do tháillí dlí

source: You are advised to obtain some quotes before deciding on a legal firm
ga: Cuirtear comhairle ort roinnt luanna a fháil sula gcinneoidh tú ar ghnólacht dlí

source: Contact information for solicitors firms throughout Ireland is available on the Law Society website
ga: Tá Eolas teagmhála do ghnólachtaí aturnaetha ar fud na hÉireann ar fáil ar shuíomh gréasáin Dhlí-Chumann na hÉireann
